legacy-rails/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "description", "release_date", "created_at", "updated_at", "tmdb_id", "poster_path", "vote_average", "genres") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "title" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["title", "Updated Title"], ["updated_at", "2026-04-20 01:19:59.171032"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)

DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 7]]
---
  def destroy
    @movie.destroy!

SELECT "movies".* FROM "movies" WHERE "movies"."tmdb_id" = $1 LIMIT $2  [["tmdb_id", 550], ["LIMIT", 1]]
UPDATE "movies" SET "title" = $1, "description" = $2, "release_date" = $3, "updated_at" = $4, "poster_path" = $5, "vote_average" = $6, "genres" = $7 WHERE "movies"."id" = $8
---
  def sync_from_tmdb
    tmdb_id = params[:tmdb_id]
    movie_data = TmdbService.new.fetch_movie(tmdb_id.to_i)
    @movie = Movie.find_or_initialize_by(tmdb_id: movie_data[:tmdb_id])
    @movie.assign_attributes(
      title: movie_data[:title],
      description: movie_data[:description],
      release_date: movie_data[:release_date],
      poster_path: movie_data[:poster_path],
      vote_average: movie_data[:vote_average],
      genres: movie_data[:genres]
    )
    @movie.save!

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
---
    def set_movie
      @movie = Movie.find(params[:id])